tests/load/api/smoke.yml
# Smoke Test Configuration - API
# Purpose: Quick validation that the API endpoints are up and responding
# Duration: ~1 minute
# Usage: artillery run tests/load/api/smoke.yml

config:
  target: "{{ $env.SERVER_URL }}:{{ $env.SERVER_PORT }}"
  
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Smoke test - API validation"
  
  processor: "../helpers/test-helpers.cjs"

  plugins:
    ensure:
      maxErrorRate: 1  # Max 1% error rate

  ensure:
    maxErrorRate: 1