tests/load/api/soak.yml
# Soak Test Configuration - API
# Purpose: Long-running test to find memory leaks and resource issues in API endpoints
# Duration: 6-12 hours
# Usage: artillery run tests/load/api/soak.yml --config tests/load/api/api-flows.yml

config:
  target: "http://{{ $env.SERVER_IP }}:{{ $env.SERVER_PORT }}"
  
  # Phases - load appropriate .env-{MATURITY} file before running
  phases:
    - duration: 5m
      arrivalRate: 1
      rampTo: 3
      name: "Gradual ramp-up"
    
    - duration: 30m
      arrivalRate: 3
      name: "Sustained baseline load"
  
  # Load processor for custom functions
  processor: "../helpers/test-helpers.cjs"
  
  # HTTP engine configuration
  http:
    timeout: 30  # 30 second timeout
    pool: 50     # Connection pool size
  
  # Plugins
  plugins:
    ensure:
      maxErrorRate: 1
  
  # Performance requirements
  ensure:
    maxErrorRate: 1
    max:
      http.response_time.p99: 1500
      http.response_time.p95: 800
      http.response_time.median: 300
    min:
      vusers.completed: 100  # At least 100 VUs should complete